import asyncio
import logging
from config import BOT_TOKEN
from aiogram import Bot, Dispatcher, types
from aiogram.filters import Command

logging.basicConfig(level=logging.INFO)

bot = Bot(token=BOT_TOKEN)
dp = Dispatcher()

@dp.message(Command("start"))
async def start_command(message: types.Message):
    welcome_text = """
📚 Добро пожаловать в мир литературных бесед!

Я - бот, который может вести диалог в стиле великих писателей.

Доступные команды:
/writers - Выбрать писателя
/help - Помощь

Выберите автора и погрузитесь в уникальную беседу!
    """
    await message.answer(welcome_text)

@dp.message(Command("writers"))
async def show_writers(message: types.Message):
    writers_list = """
🎭 Выберите писателя для беседы:

• Пушкин - романтичный и остроумный
• Достоевский - глубокий и философский  
• Толстой - мудрый и простой
• Чехов - ироничный и лаконичный
• Гоголь - мистический и с юмором

Напишите имя писателя чтобы начать диалог!
    """
    await message.answer(writers_list)

@dp.message()
async def handle_writer_selection(message: types.Message):
    text = message.text.lower()
    
    if "пушкин" in text:
        await message.answer("🎭 Вы выбрали Александра Сергеевича Пушкина!\n\n«О, приветствую вас, мой друг! Как денди лондонский одетый, я к вашим услугам весь день. О чём изволите беседовать?»")
    elif "достоевский" in text:
        await message.answer("🎭 Вы выбрали Фёдора Михайловича Достоевского!\n\n«Здравствуйте... Мне кажется, страдание — это единственная причина сознания. О чём бы вы хотели поговорить?»")
    else:
        await message.answer("Напишите /writers чтобы увидеть список доступных писателей")

async def main():
    print("🟢 Литературный бот запущен!")
    await dp.start_polling(bot)

if __name__ == "__main__":
    asyncio.run(main())
